class RivTable {
  String temp = 'ÏÀ[ƮÖ\\ơoP!òĶOƣЪËXĭĻ@:ĮöƸŝŖНƇΖ2ΔVΟňŚкŃøñŪщûĸãƼYéŦƆΙƐlú.kKŷĔŇģƅƝzКĩýŶ^ЭаÃƀСфƚŀƧŗ?èÄт-łЮЙ4ĲшхÈwцƎ>&Ż_mMĉХWŎ)ƩыŸзġāƤОťDķēhU×dƈŭЯгľGôΛİƓąŽEƔŉĈZьcŧ*CƫvМêбĎжšГřĜşőŊƕ#ČДРŋFáƘƋ5ƿ÷|ĢƪěžƠЬŮ\'ƻсƶyЫŠĬíƑƹüĤļƉůï иƂĨƊĐ;Þ\$ĵΝАźΓъƴōŹđÔЦŨƙнċjęŐţņ3Ċ=œSĝfëpƟƃШ(eƥƦяŵàbŬƢÙIБŤƞВƷÊRóэЕΚīśĒ{čnŕLgď0ėÅçxƽÝƖƛЗűƯŞ/ÕÓåрÍĦƾΘΞAq,ƳŘƌĴПĹИĺŜÁƺżŌ]уΠBƬ6äùaTĖ9~}мƵƁÐчæĠЖΜ8rƏĳðÒũƒŢħįĂĿУăJßŒЧƭЩ"ĽQ<ØųюĆйiпƲHФſĪеĀuĕĚŏŔ1ĥıТsŰÂńūĘŴÑ`+ưćЛΑŲîÆƱ%7ΒğŅÛĄÌƍвΡĞõŁþNtƗдÚìÇÉлƄÜƨâоÿΕÎΗƜ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ǀǁǂǃǄǅǆǇǈǉǊǋǌǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǤǥǦǧǨǩǪǫǬǭǮǯǰǱǲǳǴǵǶǷǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡȢȣȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿɀɁɂɃɄɅɆɇɈɉɊɋɌɍɎɏɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿˀˁ˂˃˄˅ˆˇˈˉˊˋˌˍˎˏːˑ˒˓˔˕˖˗˘˙˚˛˜˝˞˟ˠˡˢˣˤ˥˦˧˨˩˪˫ˬ˭ˮ˯˰˱˲˳˴˵˶˷˸˹˺˻˼˽˾˿̴̵̶̷̸̡̢̧̨̛̖̗̘̙̜̝̞̟̠̣̤̥̦̩̪̫̬̭̮̯̰̱̲̳̹̺̻̼͇͈͉͍͎̀́̂̃̄̅̆̇̈̉̊̋̌̍̎̏̐̑̒̓̔̽̾̿̀́͂̓̈́͆͊͋͌̕̚ͅ͏͐͑';
  // string like this must be stored in the DB

  List<String> _rivTABLE = [];

  RivTable() {
    for(int i = 0; i < temp.length; i++) {
      _rivTABLE.add(temp[i]);
    }
  }

  List<String> get table {
    return _rivTABLE;
  }
}