class RivTable {
  String defaultTable = 'ÏÀ[ƮÖ\\ơoP!òĶOƣЪËXĭĻ@:ĮöƸŝЁёŖНƇΖ2ΔVΟňŚкŃøñŪщûĸãƼYéŦƆΙƐlú.kKŷĔŇģƅƝzКĩýŶ^ЭаÃƀСфƚŀƧŗ?èÄт-łЮЙ4ĲшхÈwцƎ>&Ż_mMĉХWŎ)ƩыŸзġāƤОťDķēhU×dƈŭЯгľGôΛİƓąŽEƔŉĈZьcŧ*CƫvМêбĎжšГřĜşőŊƕ#ČДРŋFáƘƋ5ƿ÷|ĢƪěžƠЬŮ\'ƻсƶyЫŠĬíƑƹüĤļƉůï иƂĨƊĐ;Þ\$ĵΝАźΓъƴōŹđÔЦŨƙнċjęŐţņ3Ċ=œSĝfëpƟƃШ(eƥƦяŵàbŬƢÙIБŤƞВƷÊRóэЕΚīśĒ{čnŕLgď0ėÅçxƽÝƖƛЗűƯŞ/ÕÓåрÍĦƾΘΞAq,ƳŘƌĴПĹИĺŜÁƺżŌ]уΠBƬ6äùaTĖ9~}мƵƁÐчæĠЖΜ8rƏĳðÒũƒŢħįĂĿУăJßŒЧƭЩ"ĽQ<ØųюĆйiпƲHФſĪеĀuĕĚŏŔ1ĥıТsŰÂńūĘŴÑ`+ưćЛΑŲîÆƱ%7ΒğŅÛĄÌƍвΡĞõŁþNtƗдÚìÇÉлƄÜƨâоÿΕÎΗƜ¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ǀǁǂǃǄǅǆǇǈǉǊǋǌǍǎǏǐǑǒǓǔǕǖǗǘǙǚǛǜǝǞǟǠǡǢǣǤǥǦǧǨǩǪǫǬǭǮǯǰǱǲǳǴǵǶǷǸǹǺǻǼǽǾǿȀȁȂȃȄȅȆȇȈȉȊȋȌȍȎȏȐȑȒȓȔȕȖȗȘșȚțȜȝȞȟȠȡȢȣȤȥȦȧȨȩȪȫȬȭȮȯȰȱȲȳȴȵȶȷȸȹȺȻȼȽȾȿɀɁɂɃɄɅɆɇɈɉɊɋɌɍɎɏɐɑɒɓɔɕɖɗɘəɚɛɜɝɞɟɠɡɢɣɤɥɦɧɨɩɪɫɬɭɮɯɰɱɲɳɴɵɶɷɸɹɺɻɼɽɾɿʀʁʂʃʄʅʆʇʈʉʊʋʌʍʎʏʐʑʒʓʔʕʖʗʘʙʚʛʜʝʞʟʠʡʢʣʤʥʦʧʨʩʪʫʬʭʮʯʰʱʲʳʴʵʶʷʸʹʺʻʼʽʾʿˀˁ˂˃˄˅ˆˇˈˉˊˋˌˍˎˏːˑ˒˓˔˕˖˗˘˙˚˛˜˝˞˟ˠˡˢˣˤ˥˦˧˨˩˪˫ˬ˭ˮ˯˰˱˲˳˴˵˶˷˸˹˺˻˼˽˾˿̴̵̶̷̸̡̢̧̨̛̖̗̘̙̜̝̞̟̠̣̤̥̦̩̪̫̬̭̮̯̰̱̲̳̹̺̻̼͇͈͉͍͎̀́̂̃̄̅̆̇̈̉̊̋̌̍̎̏̐̑̒̓̔̽̾̿̀́͂̓̈́͆͊͋͌̕̚ͅ͏͐͑';

  List<String> _rivTABLE = [];

  RivTable() {
    _rivTABLE = defaultTable.split('');
  }

  List<String> get table {
    return _rivTABLE;
  }
  
  void setTable(String? table) {
    table = table ?? defaultTable;
    _rivTABLE = table.split('');
  }

  String tableToString() {
    return _rivTABLE.join('');
  }
}